<template lang='pug'>
	div#questionary
		div.left_questionary
			img(src='http://www.weequahic.com/blog/wp-contents/uploads/2014/06/Camp-Trivia-2-216x300.jpg')
			p {{caption}}
		div.right_questionary
			h3 {{title}}
			p(v-for='citation in citations') {{citation}}
</template>			
		

<script>
	export default {
		data(){
			return {
			caption: '"Вам понравится этот жест, потому что он предназначен всему человечеству." Альберт Энштейн (1879 - 1955 гг.)',
			title: 'Биография Эйнштейна',
			citations: [
				'Альберт Эйнштейн родился 14 марта 1879 г. в г. Ульме. Среднее образование получил в городской католической школе.',
				'В сентябре 1895 г. приехал в Цюрих для поступления в Политехникум. Получив “отлично” по математике, он провалился по французскому и ботанике. По совету директора Политехникума, поступил в кантональную школу Арау.',
				'Во время обучения изучал электромагнитную теорию Максвелла. В октябре 1896 г. стал студентом Политехникума. Здесь он сошелся с математиком М. Гроссманом.',
				'В 1901 г. была опубликована первая статья Эйнштейна, “Следствия теории капиллярности”. В это время будущий великий ученый сильно нуждался. Поэтому, благодаря “протекции” М. Гроссмана, был принят в штат Федерального Бернского Бюро патентования изобретений. Там он работал с 1902 по 1909 г.',
				'В 1904 г. стал сотрудничать с журналом “Анналы физики”. В его обязанности входило предоставление аннотаций свежих текстов по термодинамике.',
				'К наиболее известным открытиям Эйнштейна относится Специальная теория относительности. Она была опубликована в 1905 г. Работы по Общей теории относительности издавались с 1915 по 1916 гг.',
				'В 1907 г. была опубликована квантовая теория теплоемкости. В 1912 г. она была уточнена П. Дебаем, М. Борном и Т. Карманом.',
				'В 1912 г. великий ученый вернулся в Цюрих и стал преподавать в тот самом Политехникуме, где когда-то учился сам. В 1913 г., по рекомендации В. Г. Нернста и своего друга Планка, возглавил Берлинский физический исследовательский институт. Также был зачислен в преподавательский штат университета в Берлине.',
				'Эйнштейн неоднократно номинировался на Нобелевскую премию по физике. Первая номинация за теорию относительности состоялась в 1910 г., по инициативе В. Оствальда.',
				'Но Нобелевский комитет с подозрением отнесся к столь “революционной” теории. Экспериментальные доказательства Эйнштейна были признаны недостаточными.',
				'Нобеля по физике Эйнштейн получил за “безопасную” теорию фотоэффекта, в 1921 г. В это время гениальный физик был в отъезде. Поэтому премию за него получил посол Германии в Швеции Р. Надольный.',
				'В 1955 г. Эйнштейн часто и тяжко болел. Он ушел из жизни 18 апреля 1955 г. Причиной смерти стала аневризма аорты. Перед кончиной он попросил своих близких не устраивать ему пышных похорон и не разглашать место его погребения.',
				'В последний путь великого ученого провожали всего двенадцать ближайших друзей. Его тело было кремировано, а пепел развеян по ветру.'
				]
			}
		}
	}
</script>


<style lang='scss' scoped> 

@import '../styles/_reset.scss';
@import '../styles/_var.scss';

@font-face {
	font-family: 'Roboto';
	font-weight: bolder;
	src: url('~fonts/Roboto-Bold');
}
@font-face {
	font-family: 'Roboto-Regular';
	src: url('~fonts/Roboto-Regular');
}

	#questionary {
		margin-top: 40px;
		background: url('https://demiart.ru/forum/uploads1/post-76674-1222088222.jpg') no-repeat;
		background-size: cover;
		background-position: center;
		height: 900px;
		display: flex;
		justify-content: center;
		padding-top: 3%;

		.left_questionary{
			flex-basis: 40%;

			img {
				border-radius: 50%;
				margin: 20% 0 10% 35%;
			}
			p {
				font-family: 'Roboto-Regular';
				width: 280px;
				margin-left: 30%;
				line-height: 30px;
			}
		}
		.right_questionary {
			flex-basis: 40%;
			padding-left: 5%;

			h3 {
				font-family: 'Roboto';
				text-align: center;
			}
			p {
				font-family: 'Roboto-Regular';
				font-size: 14px;
				text-indent: 2em;
				text-align: justify;
				margin: 0;
			}
		}
	}	
</style>